# StairsEnableCalculationRuleChecking Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsEnableCalculationRuleChecking Property
ParameterTypeId Class See Also
---
"Enable Calculator Rules Check": Enable calculation rule checking
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsEnableCalculationRuleChecking { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsEnableCalculationRuleChecking As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsEnableCalculationRuleChecking {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace